# City Properties

---
The City type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Latitude| Latitude of the city
| Longitude| Longitude of the city
| Name| The name of the city
| TimeZone| Time-zone in which the city resides
| WeatherStation| An identifier for the nearest weather station
Top
#### Reference
City Class
Autodesk.Revit.DB Namespace